; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR R)
(ONTABLE T)
(ON R A)
(ON A T)
))
)

; plan
1. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 2 of 4
2. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 3 of 4
3. (unstack r a)
   deleted: (clear r) (handempty) (on r a)
   added: (holding r) (clear a)
   goals met: 1 of 4
4. (stack r e)
   deleted: (holding r) (clear e)
   added: (clear r) (handempty) (on r e)
   goals met: 2 of 4
5. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 2 of 4
6. (stack a t)
   deleted: (holding a) (clear t)
   added: (clear a) (handempty) (on a t)
   goals met: 3 of 4
7. (unstack r e)
   deleted: (clear r) (handempty) (on r e)
   added: (holding r) (clear e)
   goals met: 2 of 4
8. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 4 of 4
